app/controllers/articles_controller.rb

INSERT INTO "articles" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sun, 06 Apr 2014 18:03:10 UTC +00:00], ["text", "test"], ["title", "test"], ["updated_at", Sun, 06 Apr 2014 18:03:10 UTC +00:00]]
---
  def create
    @article = Article.new(article_params)

    if(@article.save)

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "2"]]
---
  def show
    @article = Article.find(params[:id])

SELECT "articles".* FROM "articles"
---
  def index
    @articles = Article.all